CREATE TABLE IF NOT EXISTS dic_go
(
    id      bigint NOT NULL PRIMARY KEY,
    name_en varchar(255),
    name_kz varchar(255),
    name_ru varchar(255)
);

CREATE INDEX IF NOT EXISTS idx_name_en_dic_go ON dic_go (name_en);
CREATE INDEX IF NOT EXISTS idx_name_ru_dic_go ON dic_go (name_ru);
CREATE INDEX IF NOT EXISTS idx_name_kz_dic_go ON dic_go (name_kz);

INSERT INTO dic_go (id, name_en, name_kz, name_ru)
VALUES
    (1,  'Министерство здравоохранения Республики Казахстан', 'Министерство здравоохранения Республики Казахстан', 'Министерство здравоохранения Республики Казахстан'),
    (2,  'Министерство цифрового развития, инноваций и аэрокосмической промышленности Республики Казахстан', 'Министерство цифрового развития, инноваций и аэрокосмической промышленности Республики Казахстан', 'Министерство цифрового развития, инноваций и аэрокосмической промышленности Республики Казахстан'),
    (3,  ' Министерство труда и социальной защиты населения Республики Казахстан', ' Министерство труда и социальной защиты населения Республики Казахстан', ' Министерство труда и социальной защиты населения Республики Казахстан'),
    (4,  'Министерство обороны   Республики Казахстан', 'Министерство обороны   Республики Казахстан', 'Министерство обороны   Республики Казахстан'),
    (5,  'Комитет по делам строительства и жилищно-коммунального хозяйства Министерства индустрии и инфраструктурного развития Республики Казахстан', 'Комитет по делам строительства и жилищно-коммунального хозяйства Министерства индустрии и инфраструктурного развития Республики Казахстан', 'Комитет по делам строительства и жилищно-коммунального хозяйства Министерства индустрии и инфраструктурного развития Республики Казахстан'),
    (6,  'АО «Казпочта»', 'АО «Казпочта»', 'АО «Казпочта»'),
    (7,  'АО «Каспи банк»', 'АО «Каспи банк»', 'АО «Каспи банк»'),
    (8,  'АГЕНТСТВО ПО СТРАТЕГИЧЕСКОМУ ПЛАНИРОВАНИЮ И РЕФОРМАМ РЕСПУБЛИКИ КАЗАХСТАН БЮРО НАЦИОНАЛЬНОЙ СТАТИСТИКИ', 'АГЕНТСТВО ПО СТРАТЕГИЧЕСКОМУ ПЛАНИРОВАНИЮ И РЕФОРМАМ РЕСПУБЛИКИ КАЗАХСТАН БЮРО НАЦИОНАЛЬНОЙ СТАТИСТИКИ', 'АГЕНТСТВО ПО СТРАТЕГИЧЕСКОМУ ПЛАНИРОВАНИЮ И РЕФОРМАМ РЕСПУБЛИКИ КАЗАХСТАН БЮРО НАЦИОНАЛЬНОЙ СТАТИСТИКИ'),
    (9,  'Министерство образования и науки Республики Казахстан', 'Министерство образования и науки Республики Казахстан', 'Министерство образования и науки Республики Казахстан'),
    (10, 'Государственные закупки Республики Казахстан', 'Государственные закупки Республики Казахстан', 'Государственные закупки Республики Казахстан'),
    (11, 'АО «Народный банк Казахстана»', 'АО «Народный банк Казахстана»', 'АО «Народный банк Казахстана»'),
    (12, 'АО "Банк Центркредит"', 'АО "Банк Центркредит"', 'АО "Банк Центркредит"'),
    (13, 'Мнистерство финансов Республики Казахстан', 'Мнистерство финансов Республики Казахстан', 'Мнистерство финансов Республики Казахстан'),
    (14, 'ГКБ', 'ГКБ', 'ГКБ'),
    (15, 'ПКБ', 'ПКБ', 'ПКБ'),
    (16, 'Верховный суд', 'Верховный суд', 'Верховный суд'),
    (17, 'Министерство внутренних дел Республики Казахстан', 'Министерство внутренних дел Республики Казахстан', 'Министерство внутренних дел Республики Казахстан'),
    (18, 'Министерство юстиции Республики Казахстан', 'Министерство юстиции Республики Казахстан', 'Министерство юстиции Республики Казахстан'),
    (19, 'АО «Жилстройсбербанк»', 'АО «Жилстройсбербанк»', 'АО «Жилстройсбербанк»'),
    (20, 'АО ДБ «Альфа банк»', 'АО ДБ «Альфа банк»', 'АО ДБ «Альфа банк»'),
    (21, 'ДБ АО «Сбербанк России»', 'ДБ АО «Сбербанк России»', 'ДБ АО «Сбербанк России»'),
    (22, 'АО «АТФ банк»', 'АО «АТФ банк»', 'АО «АТФ банк»'),
    (23, 'АО «Нурбанк»', 'АО «Нурбанк»', 'АО «Нурбанк»'),
    (24, 'ДБ АО «Хоум Кредит банк»', 'ДБ АО «Хоум Кредит банк»', 'ДБ АО «Хоум Кредит банк»'),
    (25, 'ДБ АО «Хоум Кредит банк»', 'ДБ АО «Хоум Кредит банк»', 'ДБ АО «Хоум Кредит банк»'),
    (26, 'АО «Капитал банк Казахстан»', 'АО «Капитал банк Казахстан»', 'АО «Капитал банк Казахстан»'),
    (27, 'АО «РБК банк»', 'АО «РБК банк»', 'АО «РБК банк»'),
    (28, 'АО «Тенгри банк»', 'АО «Тенгри банк»', 'АО «Тенгри банк»'),
    (29, 'АО «Евразийский банк»', 'АО «Евразийский банк»', 'АО «Евразийский банк»'),
    (30, 'АО «Форте банк»', 'АО «Форте банк»', 'АО «Форте банк»'),
    (31, 'АО «Касса Нова банк»', 'АО «Касса Нова банк»', 'АО «Касса Нова банк»'),
    (32, 'ИС BTSD Cloud E-Sign', 'ИС BTSD Cloud E-Sign', 'ИС BTSD Cloud E-Sign'),
    (33, 'Ministry of Science and Higher Education of the Republic of Kazakhstan', 'Қазақстан Республикасы Ғылым және жоғары білім министрлігі', 'Министерство науки и высшего образования Республики Казахстан'),
    (34, 'Ministry of Education of the Republic of Kazakhstan', 'Қазақстан Республикасы Оқу-ағарту министрлігі', 'Министерство просвещения Республики Казахстан')
ON CONFLICT (id) DO NOTHING;
